CocktailPages/app/controllers/cocktails_controller.rb

SELECT "cocktails".* FROM "cocktails"
---
    def index ## 칵테일 리스트
        @cocktails = Cocktail.all

INSERT INTO "cocktails" ("name", "alcohol", "sugar", "recipe", "base", "flavor", "tags", "information", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create ## 쿼리문 대신
 	 	 @cocktail = Cocktail.new(cocktail_params)

 	 	if @cocktail.save

SELECT  "cocktails".* FROM "cocktails" WHERE "cocktails"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show ## 칵테일 디테일 페이지
        @cocktail = Cocktail.find(params[:id])

SELECT  "cocktails".* FROM "cocktails" WHERE "cocktails"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def like #칵테일 좋아요
        @cocktail = Cocktail.find(params[:id])