CocktailPages/app/controllers/comments_controller.rb

SELECT  "cocktails".* FROM "cocktails" WHERE "cocktails"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "cocktail_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "hi"], ["body", "hi"], ["cocktail_id", 1], ["created_at", "2021-06-06 04:44:37.598411"], ["updated_at", "2021-06-06 04:44:37.598411"]]
---
    def create
        @cocktail=Cocktail.find(params[:cocktail_id])
        @comment=@cocktail.comments.create(comment_params)

SELECT  "cocktails".* FROM "cocktails" WHERE "cocktails"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."cocktail_id" = ? AND "comments"."id" = ? LIMIT ?  [["cocktail_id", 1], ["id", 1], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]
---
    def destroy
        @cocktail = Cocktail.find(params[:cocktail_id])
        @comment = @cocktail.comments.find(params[:id])
        @comment.destroy